sterentev/atdf-device-asm-include/inc/ATtiny2313.inc
; ----------	Register GTCCR bits		------------------------
.equ	PSR10		= 0		; 0x01 - 



; ====	USI MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register USISR bits		------------------------
.equ	USISIF		= 7		; 0x80 - Start Condition Interrupt Flag
.equ	USIOIF		= 6		; 0x40 - Counter Overflow Interrupt Flag
.equ	USIPF		= 5		; 0x20 - Stop Condition Flag
.equ	USIDC		= 4		; 0x10 - Data Output Collision
.equ	USICNT_MASK	= 0x0F		;      - USI Counter Value Bits (4 bits)
.equ	USICNT0		= 0		;          USICNT BIT0 position

; ----------	Register USICR bits		------------------------
.equ	USISIE		= 7		; 0x80 - Start Condition Interrupt Enable
.equ	USIOIE		= 6		; 0x40 - Counter Overflow Interrupt Enable
.equ	USIWM_MASK	= 0x30		;      - USI Wire Mode Bits (2 bits)
.equ	USIWM0		= 4		;          USIWM BIT0 position
.equ	USICS_MASK	= 0x0C		;      - USI Clock Source Select Bits (2 bits)
.equ	USICS0		= 2		;          USICS BIT0 position
.equ	USICLK		= 1		; 0x02 - Clock Strobe
.equ	USITC		= 0		; 0x01 - Toggle Clock Port Pin
; ::::  USIWM	:::: bitfield values
;			0x00		; Normal Operation
;			0x10		; Three-Wire Mode
;			0x20		; Two-Wire Mode
;			0x30		; Two-Wire Mode Held Low




; **********************************************************************
; ***************	INTERRUPT VECTORS	************************
; **********************************************************************
;
.equ	INT_VECTORS_NUM		= 19
.equ	INT_VECTORS_SIZE	= 0x26
;
; ----------	INTERRUPT INDEXES		------------------------
;
;	0	RESET		; External Reset, Power-on Reset and Watchdog Reset
;	1	INT0		; External Interrupt Request 0
;	2	INT1		; External Interrupt Request 1
;	3	TIMER1_CAPT	; Timer/Counter1 Capture Event
;	4	TIMER1_COMPA	; Timer/Counter1 Compare Match A
;	5	TIMER1_OVF	; Timer/Counter1 Overflow
;	6	TIMER0_OVF	; Timer/Counter0 Overflow
;	7	USART_RX	; USART, Rx Complete
;	8	USART_UDRE	; USART Data Register Empty
;	9	USART_TX	; USART, Tx Complete
;	10	ANA_COMP	; Analog Comparator
;	11	PCINT
;	12	TIMER1_COMPB
;	13	TIMER0_COMPA
;	14	TIMER0_COMPB
;	15	USI_START	; USI Start Condition
;	16	USI_OVERFLOW	; USI Overflow
;	17	EEPROM_Ready
;	18	WDT_OVERFLOW	; Watchdog Timer Overflow


; ====	ASM PROGRAM SKELETON				========
;
;  Copy-paste following definitions into your code,
;  uncomment and modify for your needs
;
; ----------	 >>>   SKELETON BEGIN   <<<	------------------------
;#	.org 0x0000
;#	; Interrupt vectors begin
;#		rjmp	RESET		; RESET		 - External Reset, Power-on Reset and Watchdog Reset
;#		rjmp	INT0_ISR	; INT0		 - External Interrupt Request 0
;#		reti			; INT1		 - External Interrupt Request 1
;#		reti			; TIMER1_CAPT	 - Timer/Counter1 Capture Event
;#		reti			; TIMER1_COMPA	 - Timer/Counter1 Compare Match A
;#		reti			; TIMER1_OVF	 - Timer/Counter1 Overflow
;#		reti			; TIMER0_OVF	 - Timer/Counter0 Overflow
;#		reti			; USART_RX	 - USART, Rx Complete
;#		reti			; USART_UDRE	 - USART Data Register Empty
;#		reti			; USART_TX	 - USART, Tx Complete
;#		reti			; ANA_COMP	 - Analog Comparator
;#		reti			; PCINT		 - 
;#		reti			; TIMER1_COMPB	 - 
;#		reti			; TIMER0_COMPA	 - 
;#		reti			; TIMER0_COMPB	 - 
;#		reti			; USI_START	 - USI Start Condition
;#		reti			; USI_OVERFLOW	 - USI Overflow
;#		reti			; EEPROM_Ready	 - 
;#		reti			; WDT_OVERFLOW	 - Watchdog Timer Overflow
;#	; Interrupt vectors end
;#	;.org INT_VECTORS_SIZE
;#	RESET:
;#		cli
;#		ldi	r16, low(ADDR_IRAM_END)
;#		out	SPL, r16
; ----------	 >>>   SKELETON  END    <<<	------------------------

#endif /* _ATTINY2313_INC_ */

; ************************ END OF FILE *********************************

